<div class="name-page">
    <h1>Новости</h1>
</div>
<div style="margin: 40px;">
    24.09.2022г 04:00<br/>
    <p><strong>Работает редактирование данных игрока через сайт!!!!</strong></p>
    Для Админов теперь доступно редактирование данных игрока!<br/>
    Все данные, которые находятся на листе "Players", можно отредактировать через сайт. Для этого:
    <li> на вкладке меню выберите пункт Players,</li>
    <li> в открывающихся списках игроков кликните на строку нужного игрока,</li>
    <li>просмотрите его данные,</li>
    <li> нажмите на кнопку "Изменить".</li> 
    <li>В открывшейся форме можно изменить любое доступное поле.</li>
    <li>Нажмите кнопку "Сохранить". (Если вы случайно изменили поле, которое не требует правки, 
        вернуть исходные значения можно нажав на кнопку "Сброс")
    </li><br>
    <p>После нажатия кнопки "Сохранить" данные отправляются обновятся в базе сайта, а также
    во всех гугл-таблицах!!!</p>
</div><hr/>