<div class="name-page">
    <h1>Новости</h1>
</div>
<hr/>
<div style="margin: 40px;">
    08.12.2022г 04:15<br/>
    <p><strong>C сайта наконец-то работает востановление игроков!!!!</strong></p>
    <div>
        <ol>
            <li> Наслаждаемся.</li><br/>
            <li> Работает не очень быстро, но здесь быстрее, чем в телеге.</li><br/>
            <li> Дождитесь окончания обновления страницы.</li><br/>
          <br>
        </ol>
    </div>
    
</div><br/><hr/>

<div style="margin: 40px;">
    27.09.2022г 19:01<br/>
    <p><strong>Теперь и добавление игроков прямо с сайта!</strong></p>
    <div>
        <ol>
            <li> Пункт меню "Добавить игрока" вполне рабочий.</li><br/>
            <li> Работает проверка вводимого ника на совпадение.</li><br/>
            <li> Выбирайте команду, вводите ник, немного нужно подождать. Поддержка таблиц тормозит скоростную базу данных.</li><br/>
            <li> Замечено, что при вводе с телефона поиск совпадения имен может не запуститься автоматически. Кнопка "Проверить" - для подстраховки. </li><br>
            <li> Восстановление по-прежнему с сайта не работает. </li>
          <br>
        </ol>
    </div>
    
</div><br/><hr/>
<div style="margin: 40px;">
    25.09.2022г 14:05<br/>
    <p><strong>Работает Перевод и Удаление через сайт!!!!</strong></p>
    <div>
        <ol>
            <li> В списке игроков после клика на строку интересующего игрока, открывается его карточка.</li><br>
            <li> В карточке работают кнопки перевода и удаления</li><br>
            <li> Восстановление пока не работает. При попытке использования, игрок восстанавливается только в базе данных. На таблицах результат не отразится.</li>
          <br>
        </ol>
    </div>
    
</div><br/><hr/>
<div style="margin: 40px;">
    24.09.2022г 04:00<br/>
    <p><strong>Работает редактирование данных игрока через сайт!!!!</strong></p>
    Для Админов теперь доступно редактирование данных игрока!<br/>
    Все данные, которые находятся на листе "Players", можно отредактировать через сайт. Для этого:
    <div>
        <ol>
            <li> на вкладке меню выберите пункт Players,</li> <br>
            <li> в открывающихся списках игроков кликните на строку нужного игрока,</li> <br>
            <li> просмотрите его данные,</li><br>
            <li> нажмите на кнопку "Изменить".</li> <br>
            <li> В открывшейся форме можно изменить любое доступное поле.</li> <br>
            <li> Нажмите кнопку "Сохранить". (Если вы случайно изменили поле, которое не требует правки, вернуть исходные значения можно нажав на кнопку "Сброс")</li>
          <br>
        </ol>
    </div><br/>
    <p>После нажатия кнопки "Сохранить" данные отправляются и обновятся в базе сайта, а также
    во всех гугл-таблицах!!!</p>
    
</div>
<hr/>